>>>> # Upflairs

In [1]:
import pandas as pd
# importing pandas dataframe

In [2]:
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 5)

## Creating Series

In [3]:
# pandas series
ser = pd.Series([2,4,5,8,7,9,6,3,2,5,4,7,8])
ser

0     2
1     4
2     5
3     8
4     7
     ..
8     2
9     5
10    4
11    7
12    8
Length: 13, dtype: int64

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
ser[ser>2]

1     4
2     5
3     8
4     7
5     9
     ..
7     3
9     5
10    4
11    7
12    8
Length: 11, dtype: int64

In [6]:
ser.dtypes

dtype('int64')

In [7]:
ser.shape
## number of row

(13,)

## creating pandas dataframe

In [8]:


student_record = {'studen_name':['mohan','syam','rocky','anjali'],
 'student_branch':['cse','ai','cse','it'],
 'student_class':[1,2,3,4],
 'student_age':[21,23,24,26],
 'student_per':[76,78,71,75]}

student_record

{'studen_name': ['mohan', 'syam', 'rocky', 'anjali'],
 'student_branch': ['cse', 'ai', 'cse', 'it'],
 'student_class': [1, 2, 3, 4],
 'student_age': [21, 23, 24, 26],
 'student_per': [76, 78, 71, 75]}

In [9]:
df = pd.DataFrame(student_record)
df
#dataframe created

  studen_name student_branch  student_class  student_age  student_per
0       mohan            cse              1           21           76
1        syam             ai              2           23           78
2       rocky            cse              3           24           71
3      anjali             it              4           26           75

In [10]:
# introducing dataframe element
df.columns

Index(['studen_name', 'student_branch', 'student_class', 'student_age',
       'student_per'],
      dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
df.shape

# 4 -- >  rows
# 5 -- >  columns

(4, 5)

In [13]:
df.dtypes
## columns types

studen_name       object
student_branch    object
student_class      int64
student_age        int64
student_per        int64
dtype: object

##  extracting columns from dataframe

In [14]:


df['studen_name']
# 'fetched student name but as series'

0     mohan
1      syam
2     rocky
3    anjali
Name: studen_name, dtype: object

In [15]:
df[['studen_name']]
# fetched as dataframe

  studen_name
0       mohan
1        syam
2       rocky
3      anjali

In [16]:
df[['studen_name','student_branch']]

  studen_name student_branch
0       mohan            cse
1        syam             ai
2       rocky            cse
3      anjali             it

## slicing

In [17]:
df[0:2]

# 0   to   2   row fetched

  studen_name student_branch  student_class  student_age  student_per
0       mohan            cse              1           21           76
1        syam             ai              2           23           78

In [18]:
df[['studen_name','student_branch']][0:2]
# row extracted with specific columns

  studen_name student_branch
0       mohan            cse
1        syam             ai

In [19]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is 9C35-B5F9

 Directory of c:\Users\Ranjit\Desktop\upflairs\ai_ml_examples\pandas

28-09-2023  12:04    <DIR>          .
28-09-2023  12:04    <DIR>          ..
28-09-2023  14:52            76,527 pandas material.ipynb
10-08-2021  00:01         2,493,547 Used_Bikes.csv
               2 File(s)      2,570,074 bytes
               2 Dir(s)  219,144,929,280 bytes free

## Slicing with LOC and ILOC

LOC end index inclusive <br>
ILOC end exclusive, <br>
[starting point , ending point , step point]

In [20]:
df[0:2]['student_class']

0    1
1    2
Name: student_class, dtype: int64

In [21]:
df.loc[0:2,'student_class']

0    1
1    2
2    3
Name: student_class, dtype: int64

In [22]:
df.loc[0:2,['studen_name','student_age']]

  studen_name  student_age
0       mohan           21
1        syam           23
2       rocky           24

In [23]:
df.iloc[0:2,0:2]

  studen_name student_branch
0       mohan            cse
1        syam             ai

In [24]:
df.iloc[0:2:2,0:2]

  studen_name student_branch
0       mohan            cse

## Reading CSV files

In [51]:
df = pd.read_csv('Used_Bikes.csv')
df

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
32643,Hero Passion Pro 100cc,39000.0,Delhi,22000.0,First Owner,4.0,100.0,Hero
32644,TVS Apache RTR 180cc,30000.0,Karnal,6639.0,First Owner,9.0,180.0,TVS
32645,Bajaj Avenger Street 220,60000.0,Delhi,20373.0,First Owner,6.0,220.0,Bajaj
32646,Hero Super Splendor 125cc,15600.0,Jaipur,84186.0,First Owner,16.0,125.0,Hero
32647,Bajaj Pulsar 150cc,22000.0,Pune,60857.0,First Owner,13.0,150.0,Bajaj

## pandas functions

In [26]:
df.head()
# return first 5 row

                              bike_name     price  ...  power          brand
0    TVS Star City Plus Dual Tone 110cc   35000.0  ...  110.0            TVS
1           Royal Enfield Classic 350cc  119900.0  ...  350.0  Royal Enfield
2                  Triumph Daytona 675R  600000.0  ...  675.0        Triumph
3                  TVS Apache RTR 180cc   65000.0  ...  180.0            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition   80000.0  ...  150.0         Yamaha

[5 rows x 8 columns]

In [27]:
df.tail()
# return last 5 row

                       bike_name    price  ...  power  brand
32643     Hero Passion Pro 100cc  39000.0  ...  100.0   Hero
32644       TVS Apache RTR 180cc  30000.0  ...  180.0    TVS
32645   Bajaj Avenger Street 220  60000.0  ...  220.0  Bajaj
32646  Hero Super Splendor 125cc  15600.0  ...  125.0   Hero
32647         Bajaj Pulsar 150cc  22000.0  ...  150.0  Bajaj

[5 rows x 8 columns]

In [28]:
df.info()
# profile of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [29]:
df.dtypes
# columns data types

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [30]:
df.shape

(32648, 8)

In [31]:
df[df['price'] <=20000]

                       bike_name    price  ...  power   brand
26     Hero Super Splendor 125cc  20000.0  ...  125.0    Hero
66          Hero CD Deluxe 100cc  12200.0  ...  100.0    Hero
85            Bajaj Pulsar 135LS  14700.0  ...  135.0   Bajaj
103           Bajaj Pulsar 150cc  11100.0  ...  150.0   Bajaj
120     Hero Splendor Plus 100cc  19695.0  ...  100.0    Hero
...                          ...      ...  ...    ...     ...
32623       Hero CD Deluxe 100cc  18000.0  ...  100.0    Hero
32624         Bajaj Pulsar 150cc  14227.0  ...  150.0   Bajaj
32631         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
32642         Hero Passion 100cc  15000.0  ...  100.0    Hero
32646  Hero Super Splendor 125cc  15600.0  ...  125.0    Hero

[5833 rows x 8 columns]

In [32]:
# extract specific columns from dataframe after filtering data

df[df['price'] <=20000][['bike_name','power']]

                       bike_name  power
26     Hero Super Splendor 125cc  125.0
66          Hero CD Deluxe 100cc  100.0
85            Bajaj Pulsar 135LS  135.0
103           Bajaj Pulsar 150cc  150.0
120     Hero Splendor Plus 100cc  100.0
...                          ...    ...
32623       Hero CD Deluxe 100cc  100.0
32624         Bajaj Pulsar 150cc  150.0
32631         Yamaha SZ-RR 150cc  150.0
32642         Hero Passion 100cc  100.0
32646  Hero Super Splendor 125cc  125.0

[5833 rows x 2 columns]

In [33]:
# multiple filter defining
df[(df['price'] <=20000) & (df['power']<=150)]

                       bike_name    price  ...  power   brand
26     Hero Super Splendor 125cc  20000.0  ...  125.0    Hero
66          Hero CD Deluxe 100cc  12200.0  ...  100.0    Hero
85            Bajaj Pulsar 135LS  14700.0  ...  135.0   Bajaj
103           Bajaj Pulsar 150cc  11100.0  ...  150.0   Bajaj
120     Hero Splendor Plus 100cc  19695.0  ...  100.0    Hero
...                          ...      ...  ...    ...     ...
32623       Hero CD Deluxe 100cc  18000.0  ...  100.0    Hero
32624         Bajaj Pulsar 150cc  14227.0  ...  150.0   Bajaj
32631         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
32642         Hero Passion 100cc  15000.0  ...  100.0    Hero
32646  Hero Super Splendor 125cc  15600.0  ...  125.0    Hero

[5767 rows x 8 columns]

## sorting

In [34]:
df2 = df[(df['price'] <=20000) & (df['power']<=150)]
df2.head()

                     bike_name    price  ...  power  brand
26   Hero Super Splendor 125cc  20000.0  ...  125.0   Hero
66        Hero CD Deluxe 100cc  12200.0  ...  100.0   Hero
85          Bajaj Pulsar 135LS  14700.0  ...  135.0  Bajaj
103         Bajaj Pulsar 150cc  11100.0  ...  150.0  Bajaj
120   Hero Splendor Plus 100cc  19695.0  ...  100.0   Hero

[5 rows x 8 columns]

In [35]:
df2.sort_values('price',ascending=False).head(20)

                       bike_name    price  ...  power   brand
26     Hero Super Splendor 125cc  20000.0  ...  125.0    Hero
24157         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
23986         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
24005         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
10021         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
...                          ...      ...  ...    ...     ...
24271         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
10059         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
10078         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
23929         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha
23910         Yamaha SZ-RR 150cc  20000.0  ...  150.0  Yamaha

[20 rows x 8 columns]

## creating a new column from existing column

In [41]:
pd.set_option('display.max_columns',20)

In [46]:
def categorise(x):
    if x == 100:
        return "NORMAL BIKE"
    elif (x <100) and (x <= 135):
        return "AVERAGE BIKE"
    else:
        return "GOOD BIKE"

In [48]:
df2['bike_category'] = df2['power'].apply(categorise)

C:\Users\Ranjit\AppData\Local\Temp\ipykernel_8436\459007400.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['bike_category'] = df2['power'].apply(categorise)

In [49]:
df2.head()

,bike_name,price,city,kms_driven,owner,age,power,brand,bike_category
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero,GOOD BIKE
66,Hero CD Deluxe 100cc,12200.0,Agra,46643.0,First Owner,14.0,100.0,Hero,NORMAL BIKE
85,Bajaj Pulsar 135LS,14700.0,Delhi,10000.0,First Owner,11.0,135.0,Bajaj,GOOD BIKE
103,Bajaj Pulsar 150cc,11100.0,Pune,12000.0,Third Owner,12.0,150.0,Bajaj,GOOD BIKE
120,Hero Splendor Plus 100cc,19695.0,Ernakulam,51576.0,First Owner,6.0,100.0,Hero,NORMAL BIKE

## apply function in pandas

In [43]:
# Create a sample dataframe
data = {'A': [1, 2, 3, 4, 5],
        'B': [6, 7, 8, 9, 10],
        'C': [11, 12, 13, 14, 15]}

df = pd.DataFrame(data)

# Define a custom function to double the value
def double(x):
    return 2 * x

# Apply the custom function to column 'A'
df['A_doubled'] = df['A'].apply(double)

In [ ]:
df['C_squared'] = df['C'].apply(lambda x: x**2)
# you can also define lambda define

In [44]:
df

   A   B   C  A_doubled
0  1   6  11          2
1  2   7  12          4
2  3   8  13          6
3  4   9  14          8
4  5  10  15         10

## merging operation in pandas

In [52]:
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [55]:
## creating two different dataframe
df1 = df.iloc[0:2000]
df2 = df.iloc[2000:]

df1.to_csv('first_table.csv',index=False)
df2.to_csv('second_table.csv',index=False)

# save two differnet .csv files then we will merge them

In [57]:
df1 = pd.read_csv('first_table.csv')
df2 = pd.read_csv('second_table.csv')

In [59]:
df1.shape,            df2.shape,             df.shape

# checking shape of our data

((2000, 8), (30648, 8), (32648, 8))

In [62]:
merged_table = pd.concat([df1,df2])
merged_table.shape

(32648, 8)

In [69]:
# Create two sample DataFrames
data1 = {'Key': ['A', 'B', 'C', 'D'],
         'Value1': [1, 2, 3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'Key': ['B', 'D', 'F', 'G'],
         'Value2': [5, 6, 7, 8]}
df2 = pd.DataFrame(data2)



# Perform an inner join based on the 'Key' column
inner_join = pd.merge(df1, df2, on='Key', how='inner')

# Perform a left join based on the 'Key' column
left_join = pd.merge(df1, df2, on='Key', how='left')

# Perform a right join based on the 'Key' column
right_join = pd.merge(df1, df2, on='Key', how='right')

# Perform an outer join based on the 'Key' column
outer_join = pd.merge(df1, df2, on='Key', how='outer')

print("Inner Join:")
print(inner_join)
print("\nLeft Join:")
print(left_join)
print("\nRight Join:")
print(right_join)
print("\nOuter Join:")
print(outer_join)

Inner Join:
  Key  Value1  Value2
0   B       2       5
1   D       4       6

Left Join:
  Key  Value1  Value2
0   A       1     NaN
1   B       2     5.0
2   C       3     NaN
3   D       4     6.0

Right Join:
  Key  Value1  Value2
0   B     2.0       5
1   D     4.0       6
2   F     NaN       7
3   G     NaN       8

Outer Join:
  Key  Value1  Value2
0   A     1.0     NaN
1   B     2.0     5.0
2   C     3.0     NaN
3   D     4.0     6.0
4   F     NaN     7.0
5   G     NaN     8.0

## GROUP BY operation

In [ ]:
1